# ValidatePHSegmentConnWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GenericMEPFailures..::..ValidatePHSegmentConnWarning Property
BuiltInFailures..::..GenericMEPFailures Class See Also
---
The placeholder curve will not be able to connect to the required fittings for placeholder convert
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ValidatePHSegmentConnWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ValidatePHSegmentConnWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ValidatePHSegmentConnWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GenericMEPFailures Class
Autodesk.Revit.DB Namespace